null-characters/esp32-s3-edge-ai-smart-led/prj-v3/sdkconfig.defaults
# ESP32-S3 配置
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# PSRAM 配置（N16R8 开发板）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_SIZE_8M=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_HEAP_EXTERNAL_MEMORY=y

# Wi-Fi 配置
CONFIG_ESP_WIFI=y
CONFIG_ESP_WIFI_STA=y

# 日志配置
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# FreeRTOS 配置
CONFIG_FREERTOS_HZ=1000

# ESP-SR 配置
CONFIG_ESP_SR_ENABLE=y
CONFIG_ESP_SR_WAKENET_ENABLE=y
CONFIG_ESP_SR_MULTINET_ENABLE=y